Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>multiformats</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_membership.this["djmcquillan"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "djmcquillan"
    }

  # github_membership.this["juliaxbow"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "juliaxbow"
    }

  # github_membership.this["sgtpooki"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "SgtPooki"
    }

  # github_membership.this["tinytb"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "tinytb"
    }

  # github_membership.this["whizzzkid"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "whizzzkid"
    }

  # github_team.this["ipfs-gui"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "IPFS GUI Team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "ipfs-gui"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.this["ipfs-gui:djmcquillan"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "djmcquillan"
    }

  # github_team_membership.this["ipfs-gui:juliaxbow"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "juliaxbow"
    }

  # github_team_membership.this["ipfs-gui:lidel"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "lidel"
    }

  # github_team_membership.this["ipfs-gui:sgtpooki"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "SgtPooki"
    }

  # github_team_membership.this["ipfs-gui:tinytb"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "tinytb"
    }

  # github_team_membership.this["ipfs-gui:whizzzkid"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "whizzzkid"
    }

  # github_team_membership.this["w3dt-stewards:djmcquillan"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "4657016"
      + username = "djmcquillan"
    }

  # github_team_membership.this["w3dt-stewards:sgtpooki"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "4657016"
      + username = "SgtPooki"
    }

  # github_team_membership.this["w3dt-stewards:whizzzkid"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "4657016"
      + username = "whizzzkid"
    }

  # github_team_repository.this["ipfs-gui:cid-utils-website"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cid-utils-website"
      + team_id    = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->